<?php

namespace Database\Seeders;

use App\Models\Brand;
use App\Models\BrandCategory;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class BrandsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Brand::insert([
            [
                'name' => 'Enerpac',
                'slug' => 'enerpac',
                'logo_name' => 'enerpac',
                'description' => 'История компании Enerpac, известной как ведущий мировой производитель гидравлики высокого давления, начиналась в начале 20-х годов прошедшего века. Сегодня под этой торговой маркой объединены более чем 1000 сотрудников, работающих в 22 странах, предлагая гидравлические цилиндры и гидродомкраты, насосы, разъёмные соединения и шланги, гайкорезы и гайковерты, съёмники, комплекты для техобслуживания магистральных и промышленных трубопроводов, комбинированные системы.  Вся программа производства Энерпак содержит более пяти тысяч наименований. <strong>Мы поставляем оборудование ENERPAC (Энерпак), а также альтернативные решения. </strong> Оставьте свою заявку ниже или позвоните нам – и мы обязательно найдём для вас оптимальное решение.',
                'brand_category_id' => BrandCategory::INDUSTRIAL_HYDRAULICS_ID
            ],
            [
                'name' => 'Bosch Rexroth',
                'slug' => 'bosch-rexroth',
                'logo_name' => 'bosch-rexroth',
                'description' => 'Осуществлять линейное или вращательное движение, выдерживать заданную скорость и плавно тормозить, обеспечивать точное позиционирование под нагрузкой, передавать мощность – такие задачи постоянно ставятся во всех отраслях техники.<br/><br/>И эти задачи эффективно решают предприятия Бош Рексрот АГ, реализующие широкую программу приводов и систем управления и регулирования. Уровень наших изделий определён высокой компетенцией, исключительным вниманием к качеству изделий и технологическим совершенством, основанном на многолетних всесторонних разработках ноу-хау. Наши агрегаты и системы соответствуют национальным и интернациональным нормам и правилам, а на всех наших предприятиях действует строгая система контроля качеств',
                'brand_category_id' => BrandCategory::INDUSTRIAL_HYDRAULICS_ID
            ],
            [
                'name' => 'Snab',
                'slug' => 'snab',
                'logo_name' => 'snab',
                'description' => 'Гидравлическое оборудование под нашим собственным брендом SNAB®! Вы можете быть уверены, что инструмент изготавливается на качественном оборудовании под руководством высококвалифицированных специалистов с соблюдением всех международных стандартов.<br/><br/>Как можно кратко описать гидравлику СНАБ?<br/><br/><strong>С — современное</strong><br/>
                <strong>Н — надёжное</strong><br/>
                <strong>А — авиапромышленное</strong><br/>
                <strong>Б — бизнес оборудование.</strong><br/><br/>Преимущества гидравлики SNAB®:<br/><br/>
                <ul>
                <li>Обширная линейка продукции позволяет подобрать такое оборудование, которое будет применимо конкретно под ваши задачи.</li>
                <li>Простота в использовании и обслуживании.</li>
                <li>Гидравлический инструмент взаимозаменяем с гидравликой большинства известных брендов.</li>
                <li>Вся продукция сертифицирована, имеет соответствующие документы и паспорт на каждую позицию. Документы всегда предоставляются вместе с товаром.</li>
                <li>Продукция проходит осмотр и проверку два раза: непосредственно на заводе после изготовления, а также в нашем сервисном центре перед отправкой Покупателю.</li>
                <li>Наличие популярных позиций на складе.</li>
                <li>Сервисный центр в г. Санкт-Петербург осуществляет гарантийное и постгарантийное обслуживание.</li>
                </ul>',
                'brand_category_id' => BrandCategory::INDUSTRIAL_HYDRAULICS_ID
            ],
            [
                'name' => 'Stalex',
                'slug' => 'stalex',
                'logo_name' => 'stalex',
                'description' => 'Впервые на российском рынке бренд STALEX появился в 2000 году и ассортимент включал в себя всего 20 станков для работы с листовым металлом европейского производства.<br/><br/>Сплоченный коллектив профессионалов, грамотное управление и невероятная энергия позволили бренду быстро развиваться. Ассортимент расширяется и компания покоряет новые рынки.<br/><br/>В 2002 году STALEX появляется в 20 региональных представительствах в крупнейших городах России. Так же начинает развиваться дилерская сеть.<br/><br/>Сегодня STALEX — это один из крупнейших российских брендов оборудования для работы с металлом, в ассортименте которого более 1 000 станков от производителей из Европы, Азии и России. Тысячи предприятий и частных клиентов в России и странах СНГ успешно используют оборудование STALEX.',
                'brand_category_id' => BrandCategory::METALWORKING_EQUIPMENT_ID
            ],
            [
                'name' => 'SKF',
                'slug' => 'skf',
                'logo_name' => 'skf',
                'description' => 'SKF (СКФ) — ведущий мировой производитель инструментов и приборов для монтажа, демонтажа, эксплуатации и диагностики технического состояния.<br/><br/>Фирма SKF была образована в 1907 году в Швеции. Её основателем стал Свен Вингквист, который изобрел самоустанавливающийся двухрядный шарикоподшипник. Деятельность компании основывалась на производстве подшипников качения для широкого спектра техники. Некогда маленькая фирма начала набирать обороты и увеличивая объемы производства за счет изначальной направленности на высокие технологии и отличное качество.<br/><br/>В настоящее время производство компании SKF направлено на индустриально-промышленную, электротехническую, автомобильную, авиационную, металлургическую и сервисную деятельность. К 2009 году SKF представляет собой 76 производственных мощностей, находящихся в 22 странах мира. Общая численность сотрудников около 38 000 человек. По миру насчитывается 15 000 дистрибьюторов фирмы. Компания имеет в Северной Америке, Европе, Юго-восточной Азии Индустриальные сервис-центры. Авторизированный сервисный центр в Москве работает с 2004 года. Компания все также производит подшипники, а также ролики и натяжители приводных ремней. Сегодня из 100 подшипников, устанавливаемых в мире — 20 являются подшипниками производства SKF. В год фирма изготавливает 600 миллионов различных подшипников (подшипники качения, подшипниковые узлы и опоры, подшипники скольжения, антифрикционные материалы, смазки).<br/><br/>Компания SKF поставляет свою продукцию на конвейеры Alfa-Romeo, Audi, BMW, Citroеn, Daewoo, DAF, Deutz, Fiat, Ford, Honda, Hyundai, IHC, Iveco, Kia, Lada, Lancia, MAN, Mazda, Mercedes-Benz, Mitsubishi, MWM, Nissan, Opel, Peugeot, Porsche, Renault, Rover, Saab, Scania, Seat, Skoda, Smart, SsangYong, Subaru, Suzuki, Talbot, Toyota, Vauxhall, Volkswagen, Volvo. Фирма SKF одна из немногих, кто обладает международным сертификатом экологической безопасности ISO 14001. Собственные научные центры позволяют проводить серьезные научные исследования в области физики качения и использовать их при изготовлении подшипников, предлагая новейшие решения в данной области.',
                'brand_category_id' => BrandCategory::BEARINGS_ID
            ],
            [
                'name' => 'INA/FAG',
                'slug' => 'ina-fag',
                'logo_name' => 'ina-fag',
                'description' => 'Компания Schaeffler — была основана в 1946 году. Основные бренды группы Schaeffler — INA, FAG (INA-FAG).<br/><br/>Специализируются на производстве подшипников для автомобильной, аэрокосмической и промышленной техники. Основные производственные мощности располагаются в Германии и Восточной Европе.<br/><br/>Продукция выпускаемая под брендом INA-FAG: подшипники качения, подшипники скольжения, подшипниковые узлы, разъемные корпуса, системы линейного перемещения, системы смазки и иные компоненты.',
                'brand_category_id' => BrandCategory::BEARINGS_ID
            ],
            [
                'name' => 'Koyo',
                'slug' => 'koyo',
                'logo_name' => 'koyo',
                'description' => '',
                'brand_category_id' => BrandCategory::BEARINGS_ID
            ],
            [
                'name' => 'SNR',
                'slug' => 'snr',
                'logo_name' => 'snr',
                'description' => '',
                'brand_category_id' => BrandCategory::BEARINGS_ID
            ],
            [
                'name' => 'Tennant',
                'slug' => 'tennant',
                'logo_name' => 'tennant',
                'description' => 'Tennant — мировой лидер в производстве профессионального уборочного оборудования, и в области инноваций.<br/><br/>Компания Tennant Company, основанная в 1870 году Джорджем Х. Теннантом, начиналась как деревообрабатывающее предприятие, состоявшее из одного человека, затем превратилась в успешную компанию по производству деревянных полов и изделий из дерева и, в конечном итоге, в производителя оборудования для уборки полов. На протяжении всей своей истории компания Tennant по-прежнему была сосредоточена на развитии нашей отрасли, агрессивно внедряя новые технологии и создавая культуру, поощряющую инновации. Сегодня Tennant является мировым лидером в разработке, производстве и маркетинге решений, которые помогают сделать мир чище, безопаснее и здоровее.<br/><br/>На протяжении всей своей истории компания Tennant уделяла особое внимание развитию отрасли, активно внедряя новые технологии и создавая культуру, поощряющую инновации. Сегодня Tennant является мировым лидером в разработке, производстве и маркетинге решений, которые помогают сделать мир чище, безопаснее и здоровее.',
                'brand_category_id' => BrandCategory::INDUSTRIAL_VACUUM_CLEANERS_AND_CLEANING_EQUIPMENT_ID
            ],
            [
                'name' => 'IPC',
                'slug' => 'ipc',
                'logo_name' => 'ipc',
                'description' => 'IPC – Комплексная профессиональная уборка – со штаб-квартирой в Италии, является одним из ведущих мировых производителей уборочных машин и оборудования. С 2017 года IPC входит в состав Tennant Company USA — компании со 150-летней историей, основанной в 1870 году Джорджем Х. Теннантом.<br/><br/>В глобальном масштабе группа IPC состоит из набора компаний, продуктов, бизнес-подразделений и услуг, полностью ориентированных на предоставление глобальных решений для нужд сектора профессиональной уборки. Размер и международное присутствие группы делают ее одним из ведущих мировых производителей профессиональных уборочных машин и оборудования с широким ассортиментом престижных продуктов и брендов для различных профилей пользователей.<br/><br/>Почти полный ассортимент продукции IPC — от ручных инструментов до высококлассных подметальных машин, охватывающих все категории, такие как пылесосы (коммерческие, профессиональные и промышленные), поломоечные машины, мойки высокого давления и т. д. — делает ее комплексным решением для клинингового сектора.',
                'brand_category_id' => BrandCategory::INDUSTRIAL_VACUUM_CLEANERS_AND_CLEANING_EQUIPMENT_ID
            ],
            [
                'name' => 'Delfin',
                'slug' => 'delfin',
                'logo_name' => 'delfin',
                'description' => 'Благодаря 30-летнему опыту инноваций на рынке промышленных вакуумных систем компания Delfin создала разнообразную линейку продуктов, состоящую из более чем 140 моделей и 1500 конфигураций для любых областей применения, типов пыли и ниш отрасли.<br/><br/>Цель Delfin заключается в создании инновационных решений для повышения эффективности продукции, обеспечения безопасности и повышения производительности.<br/><br/>Пылесосы производятся в Италии в соответствии с процессом, сертифицированным по стандарту ISO 9001. Delfin предлагает ряд сертифицированных по ATEX и IECEX пылесосов, предназначенных для обеспечения высочайшего уровня безопасности во всех отраслях промышленности.',
                'brand_category_id' => BrandCategory::INDUSTRIAL_VACUUM_CLEANERS_AND_CLEANING_EQUIPMENT_ID
            ],
            [
                'name' => 'Gausium',
                'slug' => 'gausium',
                'logo_name' => 'gausium',
                'description' => 'Компания Gausium (также известная как Gaussian Robotics) была основана Эдвардом Ченгом в 2013 году из-за страсти к автономному вождению. Он начинал как поставщик решений SLAM (одновременная локализация и картографирование) и интегрированного программного обеспечения для робототехники.<br/><br/>Сегодня Gausium стала ведущей компанией по производству автономных роботов для уборки и обслуживания на базе искусственного интеллекта с более чем 2000 успешных развертываний в 50 странах и регионах. В настоящее время продукты и услуги Gausium включают коммерческих роботов для уборки полов, роботов для доставки внутри помещений и дополнительные аксессуары, такие как док-станции, облачная платформа и прикладное программное обеспечение.<br/><br/>Продукты Gausium разрабатываются по принципу «Умнее», «Безопаснее» и «Проще», чтобы лучше удовлетворять потребности клиентов.<br/><br/>Gausium проектирует, разрабатывает и производит автономных сервисных роботов с интегрированным искусственным интеллектом, которые взаимодействуют с людьми в качестве дополнения и усовершенствования.',
                'brand_category_id' => BrandCategory::INDUSTRIAL_VACUUM_CLEANERS_AND_CLEANING_EQUIPMENT_ID
            ],
            // [
            //     'name' => 'Bahco',
            //     'slug' => 'bahco',
            //     'logo_name' => 'bahco',
            //     'description' => 'Компания Бакко располагает мощной производственной базой: 30 производственных центров в странах Западной Европы и Америки, сертифицированных по стандартам ISO 9000.<br/><br/>В производственной программе более 7 000 наименований высококачественного ручного инструмента. Каждый год не менее 2% от оборота инвестируется в исследования и новые разработки. Сами разрабатывают и производят инструмент который продают, только так достигается контроль каждой детали и гарантия качества.<br/><br/>Поставки товара происходят централизованно со склада в Голландии.<br/>Бакко Груп имеет три торговые марки: Bahco, Belzer и Lindstrom.<br/><br/>BAHCO — шарнирно-губцевый инструмент, плотницкий инструмент, всемирно известные ножовки по дереву, бор-фрезы, машинные и ручные полотна по металлу — производственный центр в Швеции. Напильники — производственный центр в Португалии. Биметаллические ленточные пилы — производство в Англии. Садовый инструмент — производство во Франции.<br/><br/>BELZER — слесарно-монтажный инструмент, гаечные ключи, головки, динамо-метрический инструмент и др. — производство в Германии.<br/><br/>LINDSTROM — инструмент для электроники и точной механики — производство в Швеции.',
            //     'brand_category_id' => BrandCategory::TOOL_AND_CAR_SERVICE_ID
            // ],
            // [
            //     'name' => 'Chicago Pneumatic',
            //     'slug' => 'chicago-pneumatic',
            //     'logo_name' => 'chicago-pneumatic',
            //     'description' => 'Компания основана в 1901 году под названием «Chicago Pneumatic Tool Company». Она начала свою деятельность с производства пневматических отбойных молотков.<br/><br/>В настоящее время компания производит дизельные и электрические компрессоры, в том числе компрессоры высокого давления (бустеры), дизельные генераторы; промышленный инструмент. Торговая и сервисная сеть компании находится более чем в 170 странах мира.',
            //     'brand_category_id' => BrandCategory::TOOL_AND_CAR_SERVICE_ID
            // ],
            // [
            //     'name' => 'Karcher',
            //     'slug' => 'karcher',
            //     'logo_name' => 'karcher',
            //     'description' => 'Немецкая компания Керхер специализируется на создании уборочной техники и технологий чистки. Является одной из крупнейших в мире компаний, которая производит технику для уборки и очистки.<br/><br/>Была основана в 1935 году инженером Альфредом Керхером в городе Штутгарт.',
            //     'brand_category_id' => BrandCategory::TOOL_AND_CAR_SERVICE_ID
            // ],
            [
                'name' => 'MAXIMA',
                'slug' => 'maxima',
                'logo_name' => 'maxima',
                'description' => 'После основания в мае 1992 года, MIT Group работает на рынке грузового транспорта, три направления разработок: электронные компоненты, механизмы и гидравлические узлы. Имея многолетний опыт, MIT Group выросла в интегрированную компанию, охватывающую более 10 филиалов, таких как авто сервисное оборудование, авто-диагностика, ремонт оборудования, перекачивающие компоненты и т.д. Бренды концерна: включает Bantam, MAXIMA, Welion, ARS и 999.<br/><br/>Как дочерняя компания в рамках MIT Group, MAXIMA является профессиональным производителем мобильных подкатных колонн для высокотоннажной техники, рейтинг No 1 в отрасли в Китае на протяжении многих лет, 65% китайского рынка и представлена в 70 странах за рубежом. С гордостью, MAXIMA является уникальной компанией в Китае, которая может обеспечить самые профессиональные инновационные решения, техническое развитие, обучение и поддержку клиентов для ремонта и обслуживания.',
                'brand_category_id' => BrandCategory::TOOL_AND_CAR_SERVICE_ID
            ],
            [
                'name' => 'HANS',
                'slug' => 'hans',
                'logo_name' => 'hans',
                'description' => 'Мировой бренд профессионального инструмента высокого качества с более чем 40-летней историей.<br/><br/>Уникальный ассортимент ручного и пневматического инструмента высокого профессионального уровня с безупречными эксплуатационными характеристиками.',
                'brand_category_id' => BrandCategory::TOOL_AND_CAR_SERVICE_ID
            ],
            [
                'name' => 'JTC Auto Tools',
                'slug' => 'jtc-auto-tools',
                'logo_name' => 'jtc-auto-tools',
                'description' => '«JTC Auto Tools» – производитель профессионального автомобильного инструмента. Продукция JTC изготавливается из высококачественных материалов в Тайване.<br/><br/>Инструмент JTC пользуется хорошей репутацией на внутреннем и международных рынках. Компания постоянно совершенствует свою продукцию и разрабатывает новые направления.<br/><br/>За свою более чем 40-летнюю историю JTC завоевала прочные позиции на рынке инструмента для автосервиса и оборудования. Тайваньская компания признана лидером на мировом рынке профессионального инструмента и оборудования для СТО.<br/><br/>JTC производит около 6000 наименований инструмента, включая пневматический, гидравлический, электрический и специальный инструмент. Компания также владеет 60 патентами на инструменты, специально разработанные для СТО. Инструмент JTC предлагает не только высокое качество, но и уникальные решения для ремонта и обслуживания автомобилей.',
                'brand_category_id' => BrandCategory::TOOL_AND_CAR_SERVICE_ID
            ],
            [
                'name' => 'Achteck',
                'slug' => 'achteck',
                'logo_name' => 'achteck',
                'description' => 'Ganzhou Achteck Tool Technology Co., Ltd. является дочерней компанией Chongyi Zhangyuan Tungsten Co., Ltd. Она была основана в 2007 году, расположена в зоне экономического развития Ганьчжоу, с площадью 200 000 м². Продукция Achteck может найти широкое применение в нефтяной, электроэнергетической, металлургической и металлургической промышленности, станках с ЧПУ и в других областях.<br/><br/><strong>Передовые Технологии Производства</strong><br/><br/>Основываясь на стандарте «Наивысший уровень технологий, оборудования и автоматизации во всем мире», используя передовые технологии производства пластин и инструментов с покрытием из цементированного карбида и выбирая самое современное оборудование для производства, исследований и разработок и контроля, Achteck основала производственную линию 10 миллионов штук (100 тонн / год). Серия изделий охватывает токарные и фрезерные пластины из чугуна, стали, нержавеющей стали и других областей применения.<br/><br/>Компания Achteck производит твердосплавные заготовки, заготовки с прямыми отверстиями и спиральными отверстиями разных размеров и диаметров. Чистые заготовки являются хорошим выбором для твердосплавных материалов, таких как концевые фрезы, сверла, микро-сверла и микро-фрезы.<br/><br/><strong>Техническая Часть</strong><br/><br/>В первую очередь, Achteck всегда придерживается духа инноваций, исследований и разработок, расширяя сотрудничество с известными отечественными и международными колледжами и университетами, уделяя особое внимание обучению внутренних талантов. В то же время компания приглашает технических специалистов из страны и из-за рубежа в этой отрасли. В результате Achteck имеет сильную команду R & D. К концу 2016 года Achteck разработала продукты, охватывающие сферы токарной обработки, фрезерования и сверления для всех типов материалов, включая сталь, нержавеющую сталь, чугун, алюминиевый сплав, суперсплав и закаленную сталь. Товарные марки AC150P и AC250P, которые используются для обработки стали и используются для массового производства и продаж, получили награду Jung Carl Gustav Technology Innovation Award 2016 года.<br/><br/>В настоящее время Achteck принадлежит 4 патента на изобретения, 11 новых практических патентов, 7 патентов на промышленный образец. Achteck установила стандартную и высокоэффективную систему управления внутренним контролем, реализовав систему 6S (система подготовки рабочего места) и внедрила систему управления качеством ISO 9001. Тем временем Achteck усиливает работу по производственному строительству, которая включает в себя сочетание и глубокую интеграцию между производственным строительством и развитием компании.',
                'brand_category_id' => BrandCategory::METALWORKING_EQUIPMENT_ID
            ],
            [
                'name' => 'SANT',
                'slug' => 'sant',
                'logo_name' => 'sant',
                'description' => 'Zhuzhou Sant Cutting Tools Co.,Ltd — компания специализирующаяся на производстве инструмента и оснастки для металлообрабатывающих станков.<br/><br/>Расположена в Чжучжоу — одной из крупнейших производственных баз производства твердосплавного инструмента в Китае. Производит в основном различный токарный инструмент (проходные и расточные державки типов P, M, D, S, W, C, державки для нарезания резьб, канавочные державки, лезвия и т.д.) фрезерный инструмент (концевые фрезы, фрезы для больших подач) сверлильный инструмент (сверла U-типа, расточные системы и т.д.), а также инструментальные системы.<br/><br/>Компания имеет сильную команду конструкторов и систему контроля качества продукции, сертифицированную по стандарту ISO 9001. Кроме того, применяется ERP система для эффективного и точного управления производством.<br/><br/>Компания производит инструмент для использования со сменными многогранными пластинами различных компаний. Фрезерный инструмент SANT может использоваться с пластинами SANDVIK, KORLOY, ZCC-CT, MITSUBISHI, JXTC. При это стоимость инструмента SANT существенно меньше оригинальных брендов при высоком уровне качества.',
                'brand_category_id' => BrandCategory::METALWORKING_EQUIPMENT_ID
            ],
            [
                'name' => 'SATOOLS',
                'slug' => 'satools',
                'logo_name' => 'satools',
                'description' => 'Собственный бренд компании «КоРУН», включающий высококачественный и экономичный инструмент и оснастку.<br/><br/>Качественный инструмент для высокоэффективного и высокоэкономичного применения на предприятиях разных отраслей.<br/><br/>Большинство позиций бренда SATOOLS вы сможете получить в максимально короткие сроки благодаря наличию большого склада в России.',
                'brand_category_id' => BrandCategory::METALWORKING_EQUIPMENT_ID
            ],
            [
                'name' => 'EFCO',
                'slug' => 'efco',
                'logo_name' => 'efco',
                'description' => 'Компания EFCO Maschinenbau GmbH была основана в 1978 году дипл.инженером Ранко Эффенбергером в Дюрене (Германия), который уже имел многолетний опыт работы и может считаться пионером в этой отрасли. С момента своего основания в 1978 году EFCO превратилась в ведущего разработчика и производителя ремонтной и испытательной техники, как с точки зрения доли рынка, так и с точки зрения технологического прогресса. Продукция продается более чем в 80 странах как через собственную торговую организацию, так и через компетентных партнеров по сбыту.<br/><br/>Строительство машин и устройств для механической обработки, ремонта и испытаний арматуры, фланцев и трубопроводов всех видов является основной компетенцией EFCO.<br/><br/>Вся наша продукция разрабатывается нами и тестируется в жестких условиях эксплуатации. Опыт, полученный в результате широкого использования многих наших клиентов, влияется в разработку продукта. Долгосрочная гарантия производства и разработки является одним из наших главных приоритетов. Лишь немногие производители могут обоснованно претендовать на всемирно признанный знак качества «Сделано в Германии».<br/><br/><strong>EFCO сертифицирована в соответствии с TÜV CERT ISO 9001 с 1996 года.</strong><br/><br/>Компетентная и опытная управленческая команда обеспечивает развитие и размещение успешного семейного бизнеса во втором поколении. С самого начала EFCO специализируется на производстве прецизионных станков и устройств для ремонта и механической обработки уплотнительных поверхностей внутри и на арматуре, фланцах и трубопроводах и т.д. и характеризуется инновационными собственными разработками. Последовательная передача информации нашим клиентам превратила менталитет обмена в культуру профилактического ремонта, которая, в свою очередь, приносит клиентам существенную экономию.<br/><br/><strong>Стандартный ассортимент EFCO включает в себя:</strong><br/><ul><li>Переносные шлифовальные и притирочные станки для герметизации поверхностей внутри и на клапанах или направляющих скольжения</li><li>Передвижная технология токарной обработки</li><li>Стационарная технология шлифования и токарной обработки</li><li>Станки для плоской притирки</li><li>Транспортируемые устройства для проверки давления срабатывания предохранительных клапанов на месте эксплуатации</li><li>Испытательные стенды арматуры, передвижные и стационарные</li><li>Запасные части и расходные материалы для ремонта, технического обслуживания и испытаний арматуры</li><li>Планирование проектов и т.д.</li></ul><br/>В дополнение к этой обширной стандартной программе EFCO предлагает проектирование и конструирование специальных машин и устройств для индивидуального решения проблем в соответствии с требованиями заказчика.',
                'brand_category_id' => BrandCategory::METALWORKING_EQUIPMENT_ID
            ],
        ]);
    }
}
