<?php

namespace Database\Seeders;

use App\Models\Product;
use App\Models\ProductModel;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class ProductModelSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        ProductModel::insert(
            array_merge(
                $this->circularSaws(),
                $this->guillotineScissors(),
                $this->sharpeningMachines(),
                $this->presses(),
                $this->desktopDrillingMachines(),
                $this->verticalMillingMachines(),
                $this->horizontalMillingMachines(),
                $this->wideUniversalMillingMachines(),
                $this->flatGrindingMachines(),
                $this->grindingMachines()
            )
        );
    }

    /**
     * Абразивно-отрезные станки
     */
    private function circularSaws()
    {
        return [
            [
                'product_id' => Product::where('name', 'Абразивно-отрезной станок ОСС.10 ОСС.01 (на тумбе)')->first()->id,
                'model_name' => 'ОСС исп 01',
                'specifications' => json_encode([
                    ['name' => 'Наибольшие размеры сечения обрабатываемой заготовки - швеллер, уголок', 'value' => '80 мм'],
                    ['name' => 'Наибольшие размеры сечения обрабатываемой заготовки - труба, сплошной круг (с переустановкой)', 'value' => 'O50 мм'],
                    ['name' => 'Угол поворота тисков по часовой стрелке / против часовой стрелки', 'value' => '45/25 градусов'],
                    ['name' => 'Размеры отрезного круга', 'value' => '400x32x3,2 мм'],
                    ['name' => 'Частота вращения шпинделя', 'value' => '2100 мин-1'],
                    ['name' => 'Мощность электродвигателя', 'value' => '2,2 кВт'],
                    ['name' => 'Габаритные размеры: длина x ширина x высота (с учетом подвижных частей)', 'value' => '1280x1600x1500 мм'],
                    ['name' => 'Масса', 'value' => '275 кг']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Абразивно-отрезной станок ОСС.10 ОСС.01 (на тумбе)')->first()->id,
                'model_name' => 'ОСС исп 10',
                'specifications' => json_encode([
                    ['name' => 'Наибольшие размеры сечения обрабатываемой заготовки - швеллер, уголок', 'value' => '80 мм'],
                    ['name' => 'Наибольшие размеры сечения обрабатываемой заготовки - труба, сплошной круг (с переустановкой)', 'value' => 'O50 мм'],
                    ['name' => 'Угол поворота тисков по часовой стрелке / против часовой стрелки', 'value' => '45/25 градусов'],
                    ['name' => 'Размеры отрезного круга', 'value' => '400x32x3,2 мм'],
                    ['name' => 'Частота вращения шпинделя', 'value' => '2100 мин-1'],
                    ['name' => 'Мощность электродвигателя', 'value' => '2,2 кВт'],
                    ['name' => 'Габаритные размеры: длина x ширина x высота (с учетом подвижных частей)', 'value' => '1280x1270x950 мм'],
                    ['name' => 'Масса', 'value' => '200 кг']
                ], JSON_UNESCAPED_UNICODE),
            ]
        ];
    }

    /**
     * Гильотинные ножницы
     */
    private function guillotineScissors()
    {
        return [
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-6x2500',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '6 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '2500 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '10~45'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '750 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '70 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '7.5 кВт'],
                    ['name' => 'Вес', 'value' => '4850 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '3240х1770х1980 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-6x3100',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '6 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '3100 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '8~45'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '750 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '70 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '7.5 кВт'],
                    ['name' => 'Вес', 'value' => '5600 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '3790х1800х2030 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-6x4000',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '6 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '4000 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '7~45'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '750 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '70 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '7.5 кВт'],
                    ['name' => 'Вес', 'value' => '7050 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '4740х1805х2110 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-6x6000',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '6 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '6000 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '5~30'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '750 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '15 кВт'],
                    ['name' => 'Вес', 'value' => '20000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '6900х2170х2750 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-8x2500',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '8 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '2500 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '10~45'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '750 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '11 кВт'],
                    ['name' => 'Вес', 'value' => '5300 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '3240х1770х2010 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-8x3100',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '8 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '3100 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '8~45'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '750 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '11 кВт'],
                    ['name' => 'Вес', 'value' => '6000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '3790х1800х2030 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-8x4000',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '8 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '4000 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '7~45'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '750 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '11 кВт'],
                    ['name' => 'Вес', 'value' => '7500 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '4740х1805х2110 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-8x6000',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '8 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '6000 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '5~30'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '750 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '22 кВт'],
                    ['name' => 'Вес', 'value' => '25000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '7000х2400х3100 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-10x2500',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '10 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '2500 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '10~35'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '750 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '11 кВт'],
                    ['name' => 'Вес', 'value' => '5800 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '3240х1770х2010 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-10x3100',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '10 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '3100 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '8~35'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '750 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '11 кВт'],
                    ['name' => 'Вес', 'value' => '6500 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '3790х1800х2030 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-10x4000',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '10 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '4000 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '6~35'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '750 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '11 кВт'],
                    ['name' => 'Вес', 'value' => '8000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '4740х1805х2110 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-12x2500',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '12 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '2500 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '10~35'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '15 кВт'],
                    ['name' => 'Вес', 'value' => '6500 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '3240х1770х2010 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-12x3100',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '12 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '3100 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '8~35'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '15 кВт'],
                    ['name' => 'Вес', 'value' => '7200 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '3790х1800х2030 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-12x4000',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '12 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '4000 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '6~35'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '15 кВт'],
                    ['name' => 'Вес', 'value' => '8700 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '4740х1805х2110 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-12x6000',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '12 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '6000 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '4~12'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '30 кВт'],
                    ['name' => 'Вес', 'value' => '28000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '7000х2400х3100 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-14x6000',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '14 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '6000 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '4~12'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '30 кВт'],
                    ['name' => 'Вес', 'value' => '32000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '7000х2400х3100 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-16x2500',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '16 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '2500 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '8~30'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-3.0'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '30 кВт'],
                    ['name' => 'Вес', 'value' => '10000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '3385х2140х2665 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-16x3100',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '16 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '3100 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '7~30'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-3.0'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '30 кВт'],
                    ['name' => 'Вес', 'value' => '12500 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '3900х2190х2430 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-16x4000',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '16 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '4000 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '6~30'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-3.0'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '30 кВт'],
                    ['name' => 'Вес', 'value' => '15200 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '4850х2340х2575 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-16x6000',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '16 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '6000 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '4~12'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '37 кВт'],
                    ['name' => 'Вес', 'value' => '36000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '7000х2400х3100 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-20x2500',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '20 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '2500 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '8~30'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-3.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '30 кВт'],
                    ['name' => 'Вес', 'value' => '17000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '3385х2140х2665 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-20x3100',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '20 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '3100 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '7~30'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-3.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '30 кВт'],
                    ['name' => 'Вес', 'value' => '19000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '3935х2260х3030 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-20x4000',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '20 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '4000 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '6~30'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-3.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '30 кВт'],
                    ['name' => 'Вес', 'value' => '21000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '4935х2330х3045 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-20x6000',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '20 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '6000 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '3~10'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-2.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '60 кВт'],
                    ['name' => 'Вес', 'value' => '50000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '7050х2600х3200 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-25x2500',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '25 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '2500 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '5~30'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-3.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '37 кВт'],
                    ['name' => 'Вес', 'value' => '22000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '3420х2555х3150 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-25x3100',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '25 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '3100 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '4~30'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-3.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '37 кВт'],
                    ['name' => 'Вес', 'value' => '26000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '3970х2230х3600 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гильотинные ножницы Farina')->first()->id,
                'model_name' => 'QC 11Y-25x4000',
                'specifications' => json_encode([
                    ['name' => 'Толщина реза (45 кг/мм²)', 'value' => '25 мм'],
                    ['name' => 'Макс. длина резки', 'value' => '4000 мм'],
                    ['name' => 'Кол-во циклов реза в минуту', 'value' => '3~30'],
                    ['name' => 'Рабочий ход заднего упора', 'value' => '1000 мм'],
                    ['name' => 'Угол резки', 'value' => '0.5-3.5'],
                    ['name' => 'Глубина зева станины', 'value' => '100 мм'],
                    ['name' => 'Мощность главн. эл.дв.', 'value' => '37 кВт'],
                    ['name' => 'Вес', 'value' => '28000 кг'],
                    ['name' => 'Габариты L х Ш х Н', 'value' => '4920х2250х3300 мм']
                ], JSON_UNESCAPED_UNICODE),
            ]
        ];
    }

    /**
     * Шлифовальные станки
     */
    private function sharpeningMachines()
    {
        return [
            [
                'product_id' => Product::where('name', 'Станки заточные настольные для сверл мод. ВЗ-322; ВЗ-323; ВЗ-389')->first()->id,
                'model_name' => 'ВЗ-322',
                'specifications' => json_encode([
                    ['name' => 'Пределы диаметров затачиваемых свёрл', 'value' => '1,0…8,0 мм'],
                    ['name' => 'Пределы задних углов сверла - главный угол', 'value' => '0…30 град'],
                    ['name' => 'Пределы задних углов сверла - вспомогательный', 'value' => '0…40 град'],
                    ['name' => 'Пределы длин затачиваемых сверл - наименьшая', 'value' => '20 мм'],
                    ['name' => 'Пределы длин затачиваемых сверл - наибольшая', 'value' => '260 мм'],
                    ['name' => 'Пределы углов при вершине', 'value' => '90…140 град'],
                    ['name' => 'Параметры шлифовального круга - наружный диаметр', 'value' => '150 мм'],
                    ['name' => 'Параметры шлифовального круга - посадочный диаметр', 'value' => '32 мм'],
                    ['name' => 'Параметры шлифовального круга - высота', 'value' => '17,5 мм'],
                    ['name' => 'Увеличение оптического устройства', 'value' => '30 крат'],
                    ['name' => 'Частота вращения шпинделя шлифовального круга', 'value' => '2710 мин-1'],
                    ['name' => 'Мощность привода главного движения', 'value' => '0,12 кВт'],
                    ['name' => 'Габаритные размеры станка - длина', 'value' => '520 мм'],
                    ['name' => 'Габаритные размеры станка - ширина', 'value' => '400 мм'],
                    ['name' => 'Габаритные размеры станка - высота', 'value' => '485 мм'],
                    ['name' => 'Масса станка', 'value' => '57 кг'],
                    ['name' => 'Класс точности станков', 'value' => 'В']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Станки заточные настольные для сверл мод. ВЗ-322; ВЗ-323; ВЗ-389')->first()->id,
                'model_name' => 'ВЗ-323',
                'specifications' => json_encode([
                    ['name' => 'Пределы диаметров затачиваемых свёрл', 'value' => '5,0…20,0 мм'],
                    ['name' => 'Пределы задних углов сверла - главный угол', 'value' => '0…30 град'],
                    ['name' => 'Пределы задних углов сверла - вспомогательный', 'value' => '0…40 град'],
                    ['name' => 'Пределы длин затачиваемых сверл - наименьшая', 'value' => '40 мм'],
                    ['name' => 'Пределы длин затачиваемых сверл - наибольшая', 'value' => '320 мм'],
                    ['name' => 'Пределы углов при вершине', 'value' => '90…140 град'],
                    ['name' => 'Параметры шлифовального круга - наружный диаметр', 'value' => '150 мм'],
                    ['name' => 'Параметры шлифовального круга - посадочный диаметр', 'value' => '32 мм'],
                    ['name' => 'Параметры шлифовального круга - высота', 'value' => '17,5 мм'],
                    ['name' => 'Увеличение оптического устройства', 'value' => '30 крат'],
                    ['name' => 'Частота вращения шпинделя шлифовального круга', 'value' => '2760 мин-1'],
                    ['name' => 'Мощность привода главного движения', 'value' => '0,25 кВт'],
                    ['name' => 'Габаритные размеры станка - длина', 'value' => '600 мм'],
                    ['name' => 'Габаритные размеры станка - ширина', 'value' => '400 мм'],
                    ['name' => 'Габаритные размеры станка - высота', 'value' => '520 мм'],
                    ['name' => 'Масса станка', 'value' => '65 кг'],
                    ['name' => 'Класс точности станков', 'value' => 'В']
                ], JSON_UNESCAPED_UNICODE),
            ],
        ];
    }

    /**
     * Гидравлические прессы
     */
    private function presses()
    {
        return [
            [
                'product_id' => Product::where('name', 'Пресса гидравлические мод. П6320Б, П6328Б, П6330-02,П6332Б')->first()->id,
                'model_name' => 'П6328, «Б»',
                'specifications' => json_encode([
                    ['name' => 'Номинальное усилие пресса', 'value' => '630 кН'],
                    ['name' => 'Ход ползуна', 'value' => '500 мм'],
                    ['name' => 'Наибольшее расстояние между столом и ползуном', 'value' => '710 мм'],
                    ['name' => 'Расстояние от оси штока до станины (вылет)', 'value' => '320 мм'],
                    ['name' => 'Размеры стола - слева-направо', 'value' => '710 мм'],
                    ['name' => 'Размеры стола - спереди-назад', 'value' => '560 мм'],
                    ['name' => 'Скорость ползуна - холостая', 'value' => '220 мм/с'],
                    ['name' => 'Скорость ползуна - рабочая', 'value' => '10…32 мм/с'],
                    ['name' => 'Скорость ползуна - возвратная', 'value' => '310 мм/с'],
                    ['name' => 'Мощность привода', 'value' => '11 кВт'],
                    ['name' => 'Габариты пресса (без правильного стола) - слева-направо', 'value' => '1080 мм'],
                    ['name' => 'Габариты пресса (без правильного стола) - спереди-назад', 'value' => '1800 мм'],
                    ['name' => 'Габариты пресса (без правильного стола) - высота', 'value' => '2900 мм'],
                    ['name' => 'Масса пресса', 'value' => '3200 кг']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Пресса гидравлические мод. П6320Б, П6328Б, П6330-02,П6332Б')->first()->id,
                'model_name' => 'П6330, «Б»',
                'specifications' => json_encode([
                    ['name' => 'Номинальное усилие пресса', 'value' => '1000 кН'],
                    ['name' => 'Ход ползуна', 'value' => '500 мм'],
                    ['name' => 'Наибольшее расстояние между столом и ползуном', 'value' => '750 мм'],
                    ['name' => 'Расстояние от оси штока до станины (вылет)', 'value' => '400 мм'],
                    ['name' => 'Размеры стола - слева-направо', 'value' => '800 мм'],
                    ['name' => 'Размеры стола - спереди-назад', 'value' => '630 мм'],
                    ['name' => 'Скорость ползуна - холостая', 'value' => '100 мм/с'],
                    ['name' => 'Скорость ползуна - рабочая', 'value' => '12 мм/с'],
                    ['name' => 'Скорость ползуна - возвратная', 'value' => '180 мм/с'],
                    ['name' => 'Мощность привода', 'value' => '15 кВт'],
                    ['name' => 'Габариты пресса (без правильного стола) - слева-направо', 'value' => '1250 мм'],
                    ['name' => 'Габариты пресса (без правильного стола) - спереди-назад', 'value' => '2150 мм'],
                    ['name' => 'Габариты пресса (без правильного стола) - высота', 'value' => '2720 мм'],
                    ['name' => 'Масса пресса', 'value' => '5600 кг']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Пресса гидравлические мод. П6320Б, П6328Б, П6330-02,П6332Б')->first()->id,
                'model_name' => 'П6332, «Б»',
                'specifications' => json_encode([
                    ['name' => 'Номинальное усилие пресса', 'value' => '1600 кН'],
                    ['name' => 'Ход ползуна', 'value' => '500 мм'],
                    ['name' => 'Наибольшее расстояние между столом и ползуном', 'value' => '750 мм'],
                    ['name' => 'Расстояние от оси штока до станины (вылет)', 'value' => '400 мм'],
                    ['name' => 'Размеры стола - слева-направо', 'value' => '800 мм'],
                    ['name' => 'Размеры стола - спереди-назад', 'value' => '630 мм'],
                    ['name' => 'Скорость ползуна - холостая', 'value' => '180 мм/с'],
                    ['name' => 'Скорость ползуна - рабочая', 'value' => '6,3…16 мм/с'],
                    ['name' => 'Скорость ползуна - возвратная', 'value' => '180 мм/с'],
                    ['name' => 'Мощность привода', 'value' => '15 кВт'],
                    ['name' => 'Габариты пресса (без правильного стола) - слева-направо', 'value' => '1250 мм'],
                    ['name' => 'Габариты пресса (без правильного стола) - спереди-назад', 'value' => '2090 мм'],
                    ['name' => 'Габариты пресса (без правильного стола) - высота', 'value' => '3500 мм'],
                    ['name' => 'Масса пресса', 'value' => '7400 кг']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Автоматические пресса GS')->first()->id,
                'model_name' => 'GS-T300',
                'specifications' => json_encode([
                    ['name' => 'Усилие', 'value' => '300 Тонн'],
                    ['name' => 'Размер стола', 'value' => '1600х2000 мм'],
                    ['name' => 'Ширина ударника', 'value' => '500х500 мм'],
                    ['name' => 'Высота подъема ударника', 'value' => '5-150 мм'],
                    ['name' => 'Мощность двигателя', 'value' => '7.2 кВт'],
                    ['name' => 'Размер транспортировочный', 'value' => '6000х3400х2650 мм'],
                    ['name' => 'Вес НЕТТО', 'value' => '3800 кг']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Автоматические пресса GS')->first()->id,
                'model_name' => 'GS -350',
                'specifications' => json_encode([
                    ['name' => 'Усилие', 'value' => '350 Тонн'],
                    ['name' => 'Размер стола', 'value' => '1600х2000 мм'],
                    ['name' => 'Ширина ударника', 'value' => '500х500 мм'],
                    ['name' => 'Высота подъема ударника', 'value' => '5-150 мм'],
                    ['name' => 'Мощность двигателя', 'value' => '8.5 кВт'],
                    ['name' => 'Размер транспортировочный', 'value' => '6000х3400х2750 мм'],
                    ['name' => 'Вес НЕТТО', 'value' => '4800 кг']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Автоматические пресса GS')->first()->id,
                'model_name' => 'GS -500',
                'specifications' => json_encode([
                    ['name' => 'Усилие', 'value' => '500 Тонн'],
                    ['name' => 'Размер стола', 'value' => '1600х2000 мм'],
                    ['name' => 'Ширина ударника', 'value' => '500х500 мм'],
                    ['name' => 'Высота подъема ударника', 'value' => '5-150 мм'],
                    ['name' => 'Мощность двигателя', 'value' => '10 кВт'],
                    ['name' => 'Размер транспортировочный', 'value' => '6000х3400х2850 мм'],
                    ['name' => 'Вес НЕТТО', 'value' => '6000 кг']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гидравлический поворотный пресс серии GS')->first()->id,
                'model_name' => 'GS-S22',
                'specifications' => json_encode([
                    ['name' => 'Усилие', 'value' => '22 Тонн'],
                    ['name' => 'Размер плиты', 'value' => '900x430 мм'],
                    ['name' => 'Ширина ударника', 'value' => '370 мм'],
                    ['name' => 'Высота подъема ударника', 'value' => '90 мм'],
                    ['name' => 'Мощность двигателя', 'value' => '1.1 кВт'],
                    ['name' => 'Размер транспортировочный', 'value' => '1050×1000×1500 мм'],
                    ['name' => 'Вес НЕТТО', 'value' => '690 кг'],
                    ['name' => 'Вес БРУТТО', 'value' => '700 кг']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гидравлический поворотный пресс серии GS')->first()->id,
                'model_name' => 'GS-S27',
                'specifications' => json_encode([
                    ['name' => 'Усилие', 'value' => '27 Тонн'],
                    ['name' => 'Размер плиты', 'value' => '1000x500 мм'],
                    ['name' => 'Ширина ударника', 'value' => '370 мм'],
                    ['name' => 'Высота подъема ударника', 'value' => '90 мм'],
                    ['name' => 'Мощность двигателя', 'value' => '1.5 кВт'],
                    ['name' => 'Размер транспортировочный', 'value' => '1100×1100×1600 мм'],
                    ['name' => 'Вес НЕТТО', 'value' => '930 кг'],
                    ['name' => 'Вес БРУТТО', 'value' => '950 кг']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гидравлический поворотный пресс серии GS')->first()->id,
                'model_name' => 'GS-S27K',
                'specifications' => json_encode([
                    ['name' => 'Усилие', 'value' => '27 Тонн'],
                    ['name' => 'Размер плиты', 'value' => '1000x500 мм'],
                    ['name' => 'Ширина ударника', 'value' => '500 мм'],
                    ['name' => 'Высота подъема ударника', 'value' => '90 мм'],
                    ['name' => 'Мощность двигателя', 'value' => '1.5 кВт'],
                    ['name' => 'Размер транспортировочный', 'value' => '1100×1100×1600 мм'],
                    ['name' => 'Вес НЕТТО', 'value' => '1000 кг'],
                    ['name' => 'Вес БРУТТО', 'value' => '1030 кг']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Гидравлический поворотный пресс серии GS')->first()->id,
                'model_name' => 'GS-S27L',
                'specifications' => json_encode([
                    ['name' => 'Усилие', 'value' => '27 Тонн'],
                    ['name' => 'Размер плиты', 'value' => '1000x500 мм'],
                    ['name' => 'Ширина ударника', 'value' => '610 мм'],
                    ['name' => 'Высота подъема ударника', 'value' => '90 мм'],
                    ['name' => 'Мощность двигателя', 'value' => '1.5 кВт'],
                    ['name' => 'Размер транспортировочный', 'value' => '1100×1100×1600 мм'],
                    ['name' => 'Вес НЕТТО', 'value' => '1030 кг'],
                    ['name' => 'Вес БРУТТО', 'value' => '1050 кг']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Листогибочный пресс')->first()->id,
                'model_name' => 'WC 67 Y- 40/2000',
                'specifications' => json_encode([
                    ['name' => 'Усилие гиба', 'value' => '40 тн'],
                    ['name' => 'Рабочая длина', 'value' => '2000 мм'],
                    ['name' => 'Расстояние между стойками', 'value' => '1615 мм'],
                    ['name' => 'Глубина зева', 'value' => '200 мм'],
                    ['name' => 'Ход Траверсы', 'value' => '100 мм'],
                    ['name' => 'Скорость свободного спуска', 'value' => '100 мм/сек'],
                    ['name' => 'Рабочая скорость', 'value' => '8 мм/сек'],
                    ['name' => 'Скорость возврата', 'value' => '70 мм/сек'],
                    ['name' => 'Расстояние между столом и траверсой', 'value' => '340 мм'],
                    ['name' => 'Мощность мотора', 'value' => '4 кВт'],
                    ['name' => 'Масса станка', 'value' => '3000 кг'],
                    ['name' => 'Габариты', 'value' => '2100х1150х2000 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Листогибочный пресс')->first()->id,
                'model_name' => 'WC 67 Y- 63/2500',
                'specifications' => json_encode([
                    ['name' => 'Усилие гиба', 'value' => '63 тн'],
                    ['name' => 'Рабочая длина', 'value' => '2500 мм'],
                    ['name' => 'Расстояние между стойками', 'value' => '2020 мм'],
                    ['name' => 'Глубина зева', 'value' => '250 мм'],
                    ['name' => 'Ход Траверсы', 'value' => '100 мм'],
                    ['name' => 'Скорость свободного спуска', 'value' => '90 мм/сек'],
                    ['name' => 'Рабочая скорость', 'value' => '8 мм/сек'],
                    ['name' => 'Скорость возврата', 'value' => '70 мм/сек'],
                    ['name' => 'Расстояние между столом и траверсой', 'value' => '335 мм'],
                    ['name' => 'Мощность мотора', 'value' => '5.5 кВт'],
                    ['name' => 'Масса станка', 'value' => '4000 кг'],
                    ['name' => 'Габариты', 'value' => '2600х1300х2090 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Листогибочный пресс')->first()->id,
                'model_name' => 'WC 67 Y- 80/2500',
                'specifications' => json_encode([
                    ['name' => 'Усилие гиба', 'value' => '80 тн'],
                    ['name' => 'Рабочая длина', 'value' => '2500 мм'],
                    ['name' => 'Расстояние между стойками', 'value' => '2015 мм'],
                    ['name' => 'Глубина зева', 'value' => '250 мм'],
                    ['name' => 'Ход Траверсы', 'value' => '100 мм'],
                    ['name' => 'Скорость свободного спуска', 'value' => '90 мм/сек'],
                    ['name' => 'Рабочая скорость', 'value' => '8 мм/сек'],
                    ['name' => 'Скорость возврата', 'value' => '70 мм/сек'],
                    ['name' => 'Расстояние между столом и траверсой', 'value' => '350 мм'],
                    ['name' => 'Мощность мотора', 'value' => '5.5 кВт'],
                    ['name' => 'Масса станка', 'value' => '4600 кг'],
                    ['name' => 'Габариты', 'value' => '2600х1300х2180 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Листогибочный пресс')->first()->id,
                'model_name' => 'WC 67 Y 80/3200',
                'specifications' => json_encode([
                    ['name' => 'Усилие гиба', 'value' => '80 тн'],
                    ['name' => 'Рабочая длина', 'value' => '3200 мм'],
                    ['name' => 'Расстояние между стойками', 'value' => '2565 мм'],
                    ['name' => 'Глубина зева', 'value' => '250 мм'],
                    ['name' => 'Ход Траверсы', 'value' => '100 мм'],
                    ['name' => 'Скорость свободного спуска', 'value' => '90 мм/сек'],
                    ['name' => 'Рабочая скорость', 'value' => '8 мм/сек'],
                    ['name' => 'Скорость возврата', 'value' => '70 мм/сек'],
                    ['name' => 'Расстояние между столом и траверсой', 'value' => '350 мм'],
                    ['name' => 'Мощность мотора', 'value' => '5.5 кВт'],
                    ['name' => 'Масса станка', 'value' => '5500 кг'],
                    ['name' => 'Габариты', 'value' => '3300х1300х2200 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Листогибочный пресс')->first()->id,
                'model_name' => 'WC 67 Y- 100/3200',
                'specifications' => json_encode([
                    ['name' => 'Усилие гиба', 'value' => '100 тн'],
                    ['name' => 'Рабочая длина', 'value' => '3200 мм'],
                    ['name' => 'Расстояние между стойками', 'value' => '2555 мм'],
                    ['name' => 'Глубина зева', 'value' => '320 мм'],
                    ['name' => 'Ход Траверсы', 'value' => '130 мм'],
                    ['name' => 'Скорость свободного спуска', 'value' => '80 мм/сек'],
                    ['name' => 'Рабочая скорость', 'value' => '10 мм/сек'],
                    ['name' => 'Скорость возврата', 'value' => '60 мм/сек'],
                    ['name' => 'Расстояние между столом и траверсой', 'value' => '380 мм'],
                    ['name' => 'Мощность мотора', 'value' => '7.5 кВт'],
                    ['name' => 'Масса станка', 'value' => '6600 кг'],
                    ['name' => 'Габариты', 'value' => '3300х1410х2320 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],

        ];
    }

    /**
     * Настольные сверлильные станки
     */
    private function desktopDrillingMachines(): array
    {
        return [
            [
                'product_id' => Product::where('name', 'Сверлильные станки ГС2112; ГС2116')->first()->id,
                'model_name' => 'ГС2112',
                'specifications' => json_encode([
                    ['name' => 'Наибольший условный диаметр сверления в стали 45 ГОСТ 1050-88, мм', 'value' => '12'],
                    ['name' => 'Наибольший диаметр нарезаемой резьбы', 'value' => '—'],
                    ['name' => 'Вылет шпинделя (расстояние от оси шпинделя до образующей колонны), мм', 'value' => '190'],
                    ['name' => 'Расстояние от нижнего торца шпинделя до рабочей поверхности плиты, мм - наибольшее, не менее', 'value' => '400'],
                    ['name' => 'Расстояние от нижнего торца шпинделя до рабочей поверхности плиты, мм - наименьшее, не более', 'value' => '50'],
                    ['name' => 'Наибольший ход шпиндельной головки, мм', 'value' => '250'],
                    ['name' => 'Наибольший ход шпинделя, мм', 'value' => '100'],
                    ['name' => 'Размер конуса шпинделя - наружный по ГОСТ 9953-82', 'value' => 'В18'],
                    ['name' => 'Размер конуса шпинделя - внутренний по ГОСТ 25557-82', 'value' => '—'],
                    ['name' => 'Число скоростей шпинделя', 'value' => '5'],
                    ['name' => 'Предел чисел оборотов шпинделя, об/мин', 'value' => '450; 800; 1400; 2500; 4500'],
                    ['name' => 'Габаритные размеры станка (L×B×H), мм, не более', 'value' => '780×410×960'],
                    ['name' => 'Масса станка, кг, не более', 'value' => '100'],
                    ['name' => 'Характеристика электродвигателя - номинальная мощность, кВт', 'value' => '0,55'],
                    ['name' => 'Характеристика электродвигателя - частота вращения, об/мин', 'value' => '1500'],
                    ['name' => 'Характеристика электродвигателя - напряжение, В', 'value' => '380'],
                    ['name' => 'Габаритные размеры упаковки (L×B×H), мм', 'value' => '900×595×1130']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Сверлильные станки ГС2112; ГС2116')->first()->id,
                'model_name' => 'ГС2116',
                'specifications' => json_encode([
                    ['name' => 'Наибольший условный диаметр сверления в стали 45 ГОСТ 1050-88, мм', 'value' => '12'],
                    ['name' => 'Наибольший диаметр нарезаемой резьбы', 'value' => '—'],
                    ['name' => 'Вылет шпинделя (расстояние от оси шпинделя до образующей колонны), мм', 'value' => '190'],
                    ['name' => 'Расстояние от нижнего торца шпинделя до рабочей поверхности плиты, мм - наибольшее, не менее', 'value' => '400'],
                    ['name' => 'Расстояние от нижнего торца шпинделя до рабочей поверхности плиты, мм - наименьшее, не более', 'value' => '100'],
                    ['name' => 'Наибольший ход шпиндельной головки, мм', 'value' => '200'],
                    ['name' => 'Наибольший ход шпинделя, мм', 'value' => '100'],
                    ['name' => 'Размер конуса шпинделя - наружный по ГОСТ 9953-82', 'value' => 'В18'],
                    ['name' => 'Размер конуса шпинделя - внутренний по ГОСТ 25557-82', 'value' => '—'],
                    ['name' => 'Число скоростей шпинделя', 'value' => '6'],
                    ['name' => 'Предел чисел оборотов шпинделя, об/мин', 'value' => '170; 280; 450; 750; 1250; 2000'],
                    ['name' => 'Габаритные размеры станка (L×B×H), мм, не более', 'value' => '785×430×975'],
                    ['name' => 'Масса станка, кг, не более', 'value' => '125'],
                    ['name' => 'Характеристика электродвигателя - номинальная мощность, кВт', 'value' => '0,55'],
                    ['name' => 'Характеристика электродвигателя - частота вращения, об/мин', 'value' => '1500'],
                    ['name' => 'Характеристика электродвигателя - напряжение, В', 'value' => '380'],
                    ['name' => 'Габаритные размеры упаковки (L×B×H), мм', 'value' => '900×595×1130']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Сверлильные станки ГС2112; ГС2116')->first()->id,
                'model_name' => 'ГС2116М',
                'specifications' => json_encode([
                    ['name' => 'Наибольший условный диаметр сверления в стали 45 ГОСТ 1050-88, мм', 'value' => '16'],
                    ['name' => 'Наибольший диаметр нарезаемой резьбы', 'value' => 'М12'],
                    ['name' => 'Вылет шпинделя (расстояние от оси шпинделя до образующей колонны), мм', 'value' => '190'],
                    ['name' => 'Расстояние от нижнего торца шпинделя до рабочей поверхности плиты, мм - наибольшее, не менее', 'value' => '400'],
                    ['name' => 'Расстояние от нижнего торца шпинделя до рабочей поверхности плиты, мм - наименьшее, не более', 'value' => '100'],
                    ['name' => 'Наибольший ход шпиндельной головки, мм', 'value' => '200'],
                    ['name' => 'Наибольший ход шпинделя, мм', 'value' => '100'],
                    ['name' => 'Размер конуса шпинделя - наружный по ГОСТ 9953-82', 'value' => '—'],
                    ['name' => 'Размер конуса шпинделя - внутренний по ГОСТ 25557-82', 'value' => 'морзе 2'],
                    ['name' => 'Число скоростей шпинделя', 'value' => '6'],
                    ['name' => 'Предел чисел оборотов шпинделя, об/мин', 'value' => '170; 280; 450; 750; 1250; 2000'],
                    ['name' => 'Габаритные размеры станка (L×B×H), мм, не более', 'value' => '785×535×975'],
                    ['name' => 'Масса станка, кг, не более', 'value' => '125'],
                    ['name' => 'Характеристика электродвигателя - номинальная мощность, кВт', 'value' => '0,55'],
                    ['name' => 'Характеристика электродвигателя - частота вращения, об/мин', 'value' => '1500'],
                    ['name' => 'Характеристика электродвигателя - напряжение, В', 'value' => '380'],
                    ['name' => 'Габаритные размеры упаковки (L×B×H), мм', 'value' => '900×595×1130']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Сверлильно-фрезерные станки СФ 16-02 и СФ 16-05')->first()->id,
                'model_name' => 'СФ16-02',
                'specifications' => json_encode([
                    ['name' => 'Условный диаметр сверления в стали', 'value' => '16 мм'],
                    ['name' => 'Наибольший диаметр сверления в стали', 'value' => '31 мм'],
                    ['name' => 'Наибольший диаметр торцевой фрезы', 'value' => '100 мм'],
                    ['name' => 'Диапазон нарезаемых резьб', 'value' => 'М5-М22'],
                    ['name' => 'Размер рабочей поверхности', 'value' => '630×250 мм'],
                    ['name' => 'Количество Т-образных пазов', 'value' => '3'],
                    ['name' => 'Ширина центрального паза', 'value' => '14Н8'],
                    ['name' => 'Наибольшее расстояние от торца шпинделя до стола', 'value' => '480 мм'],
                    ['name' => 'Перемещение стола (X, Y)', 'value' => '500×190 мм'],
                    ['name' => 'Расстояние от оси шпинделя до колонны', 'value' => '320 мм'],
                    ['name' => 'Конус шпинделя', 'value' => 'Морзе 3 (ISO40)'],
                    ['name' => 'Диапазон механических подач шпинделя', 'value' => '—'],
                    ['name' => 'Перемещение пиноли шпинделя', 'value' => '110 мм'],
                    ['name' => 'Количество частот вращения шпинделя', 'value' => '9'],
                    ['name' => 'Диапазон частот вращения шпинделя', 'value' => '90-1400 об/мин'],
                    ['name' => 'Мощность двигателя главного движения', 'value' => '1,5 кВт'],
                    ['name' => 'Поворот головки', 'value' => '—'],
                    ['name' => 'Наибольшая масса заготовки', 'value' => '100 кг'],
                    ['name' => 'Наибольшая высота заготовки', 'value' => '200 мм'],
                    ['name' => 'Масса станка', 'value' => '440 кг'],
                    ['name' => 'Габаритные размеры', 'value' => '1020×1065×1480 мм']
                ], JSON_UNESCAPED_UNICODE),
            ],
            [
                'product_id' => Product::where('name', 'Сверлильно-фрезерные станки СФ 16-02 и СФ 16-05')->first()->id,
                'model_name' => 'СФ16-05',
                'specifications' => json_encode([
                    ['name' => 'Условный диаметр сверления в стали', 'value' => '16 мм'],
                    ['name' => 'Наибольший диаметр сверления в стали', 'value' => '31 мм'],
                    ['name' => 'Наибольший диаметр торцевой фрезы', 'value' => '100 мм'],
                    ['name' => 'Диапазон нарезаемых резьб', 'value' => 'М5-М22'],
                    ['name' => 'Размер рабочей поверхности', 'value' => '630×250 мм'],
                    ['name' => 'Количество Т-образных пазов', 'value' => '3'],
                    ['name' => 'Ширина центрального паза', 'value' => '14Н8'],
                    ['name' => 'Наибольшее расстояние от торца шпинделя до стола', 'value' => '480 мм'],
                    ['name' => 'Перемещение стола (X, Y)', 'value' => '500×190 мм'],
                    ['name' => 'Расстояние от оси шпинделя до колонны', 'value' => '320 мм'],
                    ['name' => 'Конус шпинделя', 'value' => 'Морзе 3 (ISO40)'],
                    ['name' => 'Диапазон механических подач шпинделя', 'value' => '0,05...0,1; 0,1; 0,2 мм'],
                    ['name' => 'Перемещение пиноли шпинделя', 'value' => '110 мм'],
                    ['name' => 'Количество частот вращения шпинделя', 'value' => '9'],
                    ['name' => 'Диапазон частот вращения шпинделя', 'value' => '90-1400 об/мин'],
                    ['name' => 'Мощность двигателя главного движения', 'value' => '1,5 кВт'],
                    ['name' => 'Поворот головки', 'value' => '35°'],
                    ['name' => 'Наибольшая масса заготовки', 'value' => '100 кг'],
                    ['name' => 'Наибольшая высота заготовки', 'value' => '200 мм'],
                    ['name' => 'Масса станка', 'value' => '480 кг'],
                    ['name' => 'Габаритные размеры', 'value' => '1055×1062×1420 мм']
                ], JSON_UNESCAPED_UNICODE),
            ]
        ];
    }

    /**
     * Вертикально-фрезерные станки
     */
    private function verticalMillingMachines(): array
    {
        return [
            [
                'product_id' => Product::where('name', 'Консольные станки 6К11 и 6К12')->first()->id,
                'model_name' => '6К11',
                'specifications' => json_encode([
                    ['name' => 'Размеры рабочей поверхности стола', 'value' => '250×1000 мм'],
                    ['name' => 'Наибольшее перемещение стола продольное', 'value' => '710 мм'],
                    ['name' => 'Наибольшее перемещение стола поперечное', 'value' => '400 мм'],
                    ['name' => 'Наибольшее перемещение стола вертикальное', 'value' => '250 мм'],
                    ['name' => 'Количество подач', 'value' => '16'],
                    ['name' => 'Конус шпинделя', 'value' => 'ISO 50'],
                    ['name' => 'Мощность электродвигателя подач', 'value' => '1,5 кВт'],
                    ['name' => 'Мощность электродвигателя шпинделя', 'value' => '5,5 кВт'],
                    ['name' => 'Габаритные размеры станка', 'value' => '2135×1725×2015 мм'],
                    ['name' => 'Масса станка', 'value' => '2350 кг'],
                    ['name' => 'Класс точности', 'value' => 'Н']
                ]),
            ],
            [
                'product_id' => Product::where('name', 'Консольные станки 6К11 и 6К12')->first()->id,
                'model_name' => '6К12',
                'specifications' => json_encode([
                    ['name' => 'Размеры рабочей поверхности стола', 'value' => '320×1250 мм'],
                    ['name' => 'Наибольшее перемещение стола продольное', 'value' => '250 мм'],
                    ['name' => 'Наибольшее перемещение стола поперечное', 'value' => '850 мм'],
                    ['name' => 'Наибольшее перемещение стола вертикальное', 'value' => '400 мм'],
                    ['name' => 'Количество подач', 'value' => '16'],
                    ['name' => 'Конус шпинделя', 'value' => 'ISO 50'],
                    ['name' => 'Мощность электродвигателя подач', 'value' => '1,5 кВт'],
                    ['name' => 'Мощность электродвигателя шпинделя', 'value' => '5,5 кВт'],
                    ['name' => 'Габаритные размеры станка', 'value' => '2135×1865×2015 мм'],
                    ['name' => 'Масса станка', 'value' => '2380 кг'],
                    ['name' => 'Класс точности', 'value' => 'Н']
                ]),
            ],
            [
                'product_id' => Product::where('name', 'Консольные станки FSS350MR и FSS400MR')->first()->id,
                'model_name' => 'FSS350MR',
                'specifications' => json_encode([
                    ['name' => 'Модель аналога, производимого в России', 'value' => '6T12'],
                    ['name' => 'Рабочая поверхность стола', 'value' => '315×1250 мм'],
                    ['name' => 'Количество пазов для зажима', 'value' => '4'],
                    ['name' => 'Нагрузка на стол', 'value' => '1000 кг'],
                    ['name' => 'Продольное перемещение стола', 'value' => '850 мм'],
                    ['name' => 'Поперечное перемещение крестового суппорта', 'value' => '270 мм'],
                    ['name' => 'Вертикальное перемещение консоли', 'value' => '355 мм'],
                    ['name' => 'Мощность главного привода', 'value' => '5.5 кВт'],
                    ['name' => 'Макс. крутящий момент на шпинделе', 'value' => '1850 Нм'],
                    ['name' => 'Конус инструмента', 'value' => '50-ISO'],
                    ['name' => 'Диаметр переднего подшипника', 'value' => '100 мм'],
                    ['name' => 'Перемещение пиноли', 'value' => '90 мм'],
                    ['name' => 'Угол поворота в обе стороны', 'value' => '45 град.'],
                    ['name' => 'Количество подач', 'value' => '18'],
                    ['name' => 'Знаменатель геометрической прогрессии', 'value' => '1.25'],
                    ['name' => 'Диапазон частот вращения', 'value' => '28-1400 об/мин'],
                    ['name' => 'Продольные и поперечные подачи', 'value' => '16-800 мм/мин'],
                    ['name' => 'Вертикальные подачи', 'value' => '5-250 мм/мин'],
                    ['name' => 'Ускоренный ход, вдоль и поперек', 'value' => '3150 мм/мин'],
                    ['name' => 'Ускоренный ход по вертикали', 'value' => '1000 мм/мин'],
                    ['name' => 'Скорость подачи СОЖ', 'value' => '10 л/мин']
                ]),
            ],
            [
                'product_id' => Product::where('name', 'Консольные станки FSS350MR и FSS400MR')->first()->id,
                'model_name' => 'FSS400MR',
                'specifications' => json_encode([
                    ['name' => 'Модель аналога, производимого в России', 'value' => '6T13'],
                    ['name' => 'Рабочая поверхность стола', 'value' => '400×1600 мм'],
                    ['name' => 'Количество пазов для зажима', 'value' => '5'],
                    ['name' => 'Нагрузка на стол', 'value' => '1500 кг'],
                    ['name' => 'Продольное перемещение стола', 'value' => '1120 мм'],
                    ['name' => 'Поперечное перемещение крестового суппорта', 'value' => '345 мм'],
                    ['name' => 'Вертикальное перемещение консоли', 'value' => '400 мм'],
                    ['name' => 'Мощность главного привода', 'value' => '11 кВт'],
                    ['name' => 'Макс. крутящий момент на шпинделе', 'value' => '1850 Нм'],
                    ['name' => 'Конус инструмента', 'value' => '50-ISO'],
                    ['name' => 'Диаметр переднего подшипника', 'value' => '100 мм'],
                    ['name' => 'Перемещение пиноли', 'value' => '90 мм'],
                    ['name' => 'Угол поворота в обе стороны', 'value' => '45 град.'],
                    ['name' => 'Количество подач', 'value' => '18'],
                    ['name' => 'Знаменатель геометрической прогрессии', 'value' => '1.25'],
                    ['name' => 'Диапазон частот вращения', 'value' => '28-1400 об/мин'],
                    ['name' => 'Продольные и поперечные подачи', 'value' => '16-800 мм/мин'],
                    ['name' => 'Вертикальные подачи', 'value' => '5-250 мм/мин'],
                    ['name' => 'Ускоренный ход, вдоль и поперек', 'value' => '3150 мм/мин'],
                    ['name' => 'Ускоренный ход по вертикали', 'value' => '1000 мм/мин'],
                    ['name' => 'Скорость подачи СОЖ', 'value' => '10 л/мин']
                ]),
            ]
        ];
    }

    /**
     * Горизонтально-фрезерные станки
     */
    private function horizontalMillingMachines(): array
    {
        return [
            [
                'product_id' => Product::where('name', 'Консольно-фрезерные станки 6К81Г и 6К82Г')->first()->id,
                'model_name' => '6К81Г',
                'specifications' => json_encode([
                    ['name' => 'Размер рабочей поверхности (зеркала) стола', 'value' => '250 х 1000 мм'],
                    ['name' => 'Наибольшее продольное перемещение стола', 'value' => '710 мм'],
                    ['name' => 'Наибольшее поперечное перемещение стола', 'value' => '250 мм'],
                    ['name' => 'Наибольшее вертикальное перемещение стола', 'value' => '400 мм'],
                    ['name' => 'Количество частот вращения (скоростей) шпинделя', 'value' => '21'],
                    ['name' => 'Частота вращения шпинделя', 'value' => '16-1600 мин⁻¹'],
                    ['name' => 'Конус шпинделя', 'value' => 'ISO 50'],
                    ['name' => 'Диапазон продольных и поперечных подач стола', 'value' => '35-1020 (продольн.); 27-790 (попереч.) мм/мин'],
                    ['name' => 'Диапазон вертикальных подач стола', 'value' => '9-264 мм/мин'],
                    ['name' => 'Скорость быстрого установочного перемещения стола', 'value' => '2,9 (продольн.); 2,3 (поперечн.); 1,15 (вертикал.) м/мин'],
                    ['name' => 'Мощность привода главного движения', 'value' => '5,5 кВт'],
                    ['name' => 'Мощность двигателя подач', 'value' => '1,5 кВт'],
                    ['name' => 'Класс точности', 'value' => 'Н'],
                    ['name' => 'Номинальное напряжение питания', 'value' => '380 В'],
                    ['name' => 'Габаритные размеры', 'value' => '2135 х 1865 х 1695 мм'],
                    ['name' => 'Масса', 'value' => '2300 кг']
                ]),
            ],
            [
                'product_id' => Product::where('name', 'Консольно-фрезерные станки 6К81Г и 6К82Г')->first()->id,
                'model_name' => '6К82Г',
                'specifications' => json_encode([
                    ['name' => 'Размер рабочей поверхности (зеркала) стола', 'value' => '320 х 1250 мм'],
                    ['name' => 'Наибольшее продольное перемещение стола', 'value' => '850 мм'],
                    ['name' => 'Наибольшее поперечное перемещение стола', 'value' => '250 мм'],
                    ['name' => 'Наибольшее вертикальное перемещение стола', 'value' => '400 мм'],
                    ['name' => 'Количество частот вращения (скоростей) шпинделя', 'value' => '21'],
                    ['name' => 'Частота вращения шпинделя', 'value' => '16-1600 мин⁻¹'],
                    ['name' => 'Конус шпинделя', 'value' => 'ISO 50'],
                    ['name' => 'Диапазон продольных и поперечных подач стола', 'value' => '35-1020 (продольн.); 27-790 (попереч.) мм/мин'],
                    ['name' => 'Диапазон вертикальных подач стола', 'value' => '9-264 мм/мин'],
                    ['name' => 'Скорость быстрого установочного перемещения стола', 'value' => '2,9 (продольн.); 2,3 (поперечн.); 1,15 (вертикал.) м/мин'],
                    ['name' => 'Мощность привода главного движения', 'value' => '5,5 кВт'],
                    ['name' => 'Мощность двигателя подач', 'value' => '1,5 кВт'],
                    ['name' => 'Класс точности', 'value' => 'Н'],
                    ['name' => 'Номинальное напряжение питания', 'value' => '380 В'],
                    ['name' => 'Габаритные размеры', 'value' => '2135 х 1865 х 1695 мм'],
                    ['name' => 'Масса', 'value' => '2300 кг']
                ]),
            ]
        ];
    }

    /**
     * Широкоуниверсальные фрезерные станки
     */
    private function wideUniversalMillingMachines(): array
    {
        return [
            [
                'product_id' => Product::where('name', 'Консольные широкоуниверсальные станки 6М81Ш и6М82Ш')->first()->id,
                'model_name' => '6М81Ш',
                'specifications' => json_encode([
                    ['name' => 'Размеры рабочей поверхности стола', 'value' => '250×1000 мм'],
                    ['name' => 'Наибольшее продольное перемещение стола', 'value' => '710 мм'],
                    ['name' => 'Наибольшее поперечное перемещение стола', 'value' => '250 мм'],
                    ['name' => 'Наибольшее вертикальное перемещение стола', 'value' => '400 мм'],
                    ['name' => 'Наибольшее перемещение гильзы вертикального шпинделя', 'value' => '80 мм'],
                    ['name' => 'Пределы продольной подачи стола', 'value' => '10-3000 мм/мин'],
                    ['name' => 'Пределы поперечной подачи стола', 'value' => '10-3000 мм/мин'],
                    ['name' => 'Пределы вертикальной подачи стола', 'value' => '10-1000 мм/мин'],
                    ['name' => 'Количество частот вращения горизонтального шпинделя', 'value' => '21'],
                    ['name' => 'Количество частот вращения вертикального шпинделя', 'value' => '12'],
                    ['name' => 'Пределы частот вращения горизонтального шпинделя', 'value' => '16-1600 мин⁻¹'],
                    ['name' => 'Пределы частот вращения вертикального шпинделя', 'value' => '31,5-1400 мин⁻¹'],
                    ['name' => 'Конус горизонтального шпинделя', 'value' => 'ISO 50'],
                    ['name' => 'Конус вертикального шпинделя', 'value' => 'ISO 40'],
                    ['name' => 'Угол поворота оси вертикального шпинделя к станине', 'value' => '45 град.'],
                    ['name' => 'Угол поворота оси вертикального шпинделя от станины', 'value' => '90 град.'],
                    ['name' => 'Угол поворота в продольной плоскости', 'value' => '90 град.'],
                    ['name' => 'Мощность электродвигателя подач', 'value' => '2,2 кВт'],
                    ['name' => 'Мощность электродвигателя вертикального шпинделя', 'value' => '2,2 кВт'],
                    ['name' => 'Мощность электродвигателя горизонтального шпинделя', 'value' => '5,5 кВт'],
                    ['name' => 'Габаритные размеры станка', 'value' => '2135х1725х2015 мм'],
                    ['name' => 'Масса станка', 'value' => '2500 кг'],
                    ['name' => 'Класс точности', 'value' => 'П']
                ]),
            ],
            [
                'product_id' => Product::where('name', 'Консольные широкоуниверсальные станки 6М81Ш и6М82Ш')->first()->id,
                'model_name' => '6М82Ш',
                'specifications' => json_encode([
                    ['name' => 'Размеры рабочей поверхности стола', 'value' => '320×1250 мм'],
                    ['name' => 'Наибольшее продольное перемещение стола', 'value' => '850 мм'],
                    ['name' => 'Наибольшее поперечное перемещение стола', 'value' => '250 мм'],
                    ['name' => 'Наибольшее вертикальное перемещение стола', 'value' => '400 мм'],
                    ['name' => 'Наибольшее перемещение гильзы вертикального шпинделя', 'value' => '80 мм'],
                    ['name' => 'Пределы продольной подачи стола', 'value' => '10-3000 мм/мин'],
                    ['name' => 'Пределы поперечной подачи стола', 'value' => '10-3000 мм/мин'],
                    ['name' => 'Пределы вертикальной подачи стола', 'value' => '10-1000 мм/мин'],
                    ['name' => 'Количество частот вращения горизонтального шпинделя', 'value' => '21'],
                    ['name' => 'Количество частот вращения вертикального шпинделя', 'value' => '12'],
                    ['name' => 'Пределы частот вращения горизонтального шпинделя', 'value' => '16-1600 мин⁻¹'],
                    ['name' => 'Пределы частот вращения вертикального шпинделя', 'value' => '31,5-1400 мин⁻¹'],
                    ['name' => 'Конус горизонтального шпинделя', 'value' => 'ISO 50'],
                    ['name' => 'Конус вертикального шпинделя', 'value' => 'ISO 40'],
                    ['name' => 'Угол поворота оси вертикального шпинделя к станине', 'value' => '45 град.'],
                    ['name' => 'Угол поворота оси вертикального шпинделя от станины', 'value' => '90 град.'],
                    ['name' => 'Угол поворота в продольной плоскости', 'value' => '90 град.'],
                    ['name' => 'Мощность электродвигателя подач', 'value' => '2,2 кВт'],
                    ['name' => 'Мощность электродвигателя вертикального шпинделя', 'value' => '2,2 кВт'],
                    ['name' => 'Мощность электродвигателя горизонтального шпинделя', 'value' => '5,5 кВт'],
                    ['name' => 'Габаритные размеры станка', 'value' => '2135х1865х2015 мм'],
                    ['name' => 'Масса станка', 'value' => '2560 кг'],
                    ['name' => 'Класс точности', 'value' => 'П']
                ]),
            ],
            [
                'product_id' => Product::where('name', 'Универсальные фрезерные станки 6К81Ш и 6К82Ш')->first()->id,
                'model_name' => '6К81Ш',
                'specifications' => json_encode([
                    ['name' => 'Размеры рабочей поверхности стола', 'value' => '250×1000 мм'],
                    ['name' => 'Наибольшее продольное перемещение стола', 'value' => '710 мм'],
                    ['name' => 'Наибольшее поперечное перемещение стола', 'value' => '250 мм'],
                    ['name' => 'Наибольшее вертикальное перемещение стола', 'value' => '400 мм'],
                    ['name' => 'Количество подач', 'value' => '16'],
                    ['name' => 'Конус горизонтального шпинделя', 'value' => 'ISO 50'],
                    ['name' => 'Конус вертикального шпинделя', 'value' => 'ISO 40'],
                    ['name' => 'Мощность электродвигателя подач', 'value' => '1,5 кВт'],
                    ['name' => 'Мощность электродвигателя вертикального шпинделя', 'value' => '2,2 кВт'],
                    ['name' => 'Мощность электродвигателя горизонтального шпинделя', 'value' => '5,5 кВт'],
                    ['name' => 'Габаритные размеры станка', 'value' => '2135 x 1725 x 2015 мм'],
                    ['name' => 'Масса станка', 'value' => '2500 кг'],
                    ['name' => 'Класс точности', 'value' => 'П']
                ]),
            ],
            [
                'product_id' => Product::where('name', 'Универсальные фрезерные станки 6К81Ш и 6К82Ш')->first()->id,
                'model_name' => '6К82Ш',
                'specifications' => json_encode([
                    ['name' => 'Размеры рабочей поверхности стола', 'value' => '320×1250 мм'],
                    ['name' => 'Наибольшее продольное перемещение стола', 'value' => '850 мм'],
                    ['name' => 'Наибольшее поперечное перемещение стола', 'value' => '250 мм'],
                    ['name' => 'Наибольшее вертикальное перемещение стола', 'value' => '400 мм'],
                    ['name' => 'Количество подач', 'value' => '16'],
                    ['name' => 'Конус горизонтального шпинделя', 'value' => 'ISO 50'],
                    ['name' => 'Конус вертикального шпинделя', 'value' => 'ISO 40'],
                    ['name' => 'Мощность электродвигателя подач', 'value' => '1,5 кВт'],
                    ['name' => 'Мощность электродвигателя вертикального шпинделя', 'value' => '2,2 кВт'],
                    ['name' => 'Мощность электродвигателя горизонтального шпинделя', 'value' => '5,5 кВт'],
                    ['name' => 'Габаритные размеры станка', 'value' => '2135 x 1865 x 2015 мм'],
                    ['name' => 'Масса станка', 'value' => '2560 кг'],
                    ['name' => 'Класс точности', 'value' => 'П']
                ]),
            ]
        ];
    }

    /**
     * Плоскошлифовальные станки
     */
    private function flatGrindingMachines(): array
    {
        return [
            [
                'product_id' => Product::where('name', 'Станок плоскошлифовальный мод. ОШ-400 и ОШ-550')->first()->id,
                'model_name' => 'ОШ-400',
                'specifications' => json_encode([
                    ['name' => 'Класс точности станка по ГОСТ 8-82', 'value' => 'В'],
                    ['name' => 'Размеры зеркала стола (BxL)', 'value' => '400х800 мм'],
                    ['name' => 'Размер образца изделия', 'value' => '400х150х120 мм'],
                    ['name' => 'Плоскостность', 'value' => '4 мкм'],
                    ['name' => 'Параллельность', 'value' => '5 мкм'],
                    ['name' => 'Шероховатость поверхности, обработанной периферией круга', 'value' => 'Ra 0,16'],
                    ['name' => 'Рабочие подачи стола', 'value' => '1…30 м/мин'],
                    ['name' => 'Рабочие подачи суппорта', 'value' => '0,3…40 мм/ход'],
                    ['name' => 'Рабочие подачи шлифовальной головки', 'value' => '0,002…0,08 мм'],
                    ['name' => 'Наибольшее перемещение стола', 'value' => '810 мм'],
                    ['name' => 'Наибольшее перемещение суппорта', 'value' => '445 мм'],
                    ['name' => 'Наибольшая масса устанавливаемой заготовки', 'value' => '400 кг'],
                    ['name' => 'Наибольшее расстояние от зеркала стола до оси шпинделя', 'value' => '650 мм'],
                    ['name' => 'Размеры шлифовального круга (DxHxd)', 'value' => '400х80х127 мм'],
                    ['name' => 'Мощность главного привода', 'value' => '7,5 кВт'],
                    ['name' => 'Габаритные размеры длина', 'value' => '3200 мм'],
                    ['name' => 'Габаритные размеры ширина', 'value' => '2540 мм'],
                    ['name' => 'Габаритные размеры высота', 'value' => '2140 мм'],
                    ['name' => 'Масса', 'value' => '3600 кг']
                ]),
            ],
            [
                'product_id' => Product::where('name', 'Станок плоскошлифовальный мод. ОШ-400 и ОШ-550')->first()->id,
                'model_name' => 'ОШ-550',
                'specifications' => json_encode([
                    ['name' => 'Класс точности станка по ГОСТ 8-82', 'value' => 'В'],
                    ['name' => 'Размеры зеркала стола (BxL)', 'value' => '400х800 мм'],
                    ['name' => 'Размер образца изделия', 'value' => '400х150х120 мм'],
                    ['name' => 'Плоскостность', 'value' => '4 мкм'],
                    ['name' => 'Параллельность', 'value' => '5 мкм'],
                    ['name' => 'Шероховатость поверхности, обработанной периферией круга', 'value' => 'Ra 0,16'],
                    ['name' => 'Рабочие подачи стола', 'value' => '1…25 м/мин'],
                    ['name' => 'Рабочие подачи суппорта', 'value' => '0,3…40 мм/ход'],
                    ['name' => 'Рабочие подачи шлифовальной головки', 'value' => '0,002…0,08 мм'],
                    ['name' => 'Наибольшее перемещение стола', 'value' => '1160 мм'],
                    ['name' => 'Наибольшее перемещение суппорта', 'value' => '445 мм'],
                    ['name' => 'Наибольшая масса устанавливаемой заготовки', 'value' => '300 кг'],
                    ['name' => 'Наибольшее расстояние от зеркала стола до оси шпинделя', 'value' => '650 мм'],
                    ['name' => 'Размеры шлифовального круга (DxHxd)', 'value' => '400х80х127 мм'],
                    ['name' => 'Мощность главного привода', 'value' => '7,5 кВт'],
                    ['name' => 'Габаритные размеры длина', 'value' => '3800 мм'],
                    ['name' => 'Габаритные размеры ширина', 'value' => '2540 мм'],
                    ['name' => 'Габаритные размеры высота', 'value' => '2140 мм'],
                    ['name' => 'Масса', 'value' => '4150 кг']
                ]),
            ]
        ];
    }

    /**
     * Точильно-шлифовальные станки
     */
    private function grindingMachines(): array
    {
        return [
            [
                'product_id' => Product::where('name', 'Точильно-шлифовальные станки ТШ-1.10; ТШ-1.25 (с пылесосом); ТШ-2.10; ТШ-2.25 (с пылесосом); ТШ-3; ТШ-4; ТШ-4х01')->first()->id,
                'model_name' => 'ТШ-1',
                'specifications' => json_encode([
                    ['name' => 'Диаметр круга', 'value' => '250 мм'],
                    ['name' => 'Диаметр посадочного отв. Круга', 'value' => '32 мм'],
                    ['name' => 'Количество шлифовальных кругов', 'value' => '2'],
                    ['name' => 'Частота вращения шпинделя', 'value' => '1500 об/мин'],
                    ['name' => 'Мощность электродвигателя', 'value' => '2,2 кВт'],
                    ['name' => 'Габаритные размеры', 'value' => '610×395×535 мм'],
                    ['name' => 'Масса', 'value' => '78,5 кг']
                ]),
            ],
            [
                'product_id' => Product::where('name', 'Точильно-шлифовальные станки ТШ-1.10; ТШ-1.25 (с пылесосом); ТШ-2.10; ТШ-2.25 (с пылесосом); ТШ-3; ТШ-4; ТШ-4х01')->first()->id,
                'model_name' => 'ТШ-2',
                'specifications' => json_encode([
                    ['name' => 'Диаметр круга', 'value' => '300 мм'],
                    ['name' => 'Диаметр посадочного отв. Круга', 'value' => '76 мм'],
                    ['name' => 'Количество шлифовальных кругов', 'value' => '2'],
                    ['name' => 'Частота вращения шпинделя', 'value' => '1500 об/мин'],
                    ['name' => 'Мощность электродвигателя', 'value' => '2,2 кВт'],
                    ['name' => 'Габаритные размеры', 'value' => '610×450×1260 мм'],
                    ['name' => 'Масса', 'value' => '108,5 кг']
                ]),
            ],
            [
                'product_id' => Product::where('name', 'Точильно-шлифовальные станки ТШ-1.10; ТШ-1.25 (с пылесосом); ТШ-2.10; ТШ-2.25 (с пылесосом); ТШ-3; ТШ-4; ТШ-4х01')->first()->id,
                'model_name' => 'ТШ-3',
                'specifications' => json_encode([
                    ['name' => 'Диаметр круга', 'value' => '400 мм'],
                    ['name' => 'Диаметр посадочного отв. Круга', 'value' => '127 мм'],
                    ['name' => 'Количество шлифовальных кругов', 'value' => '2'],
                    ['name' => 'Частота вращения шпинделя', 'value' => '1000 об/мин'],
                    ['name' => 'Мощность электродвигателя', 'value' => '3 кВт'],
                    ['name' => 'Габаритные размеры', 'value' => '660×600×1370 мм'],
                    ['name' => 'Масса', 'value' => '220 кг']
                ]),
            ],
            [
                'product_id' => Product::where('name', 'Точильно-шлифовальные станки ТШ-1.10; ТШ-1.25 (с пылесосом); ТШ-2.10; ТШ-2.25 (с пылесосом); ТШ-3; ТШ-4; ТШ-4х01')->first()->id,
                'model_name' => 'ТШ-4',
                'specifications' => json_encode([
                    ['name' => 'Диаметр круга', 'value' => '400 мм'],
                    ['name' => 'Диаметр посадочного отв. Круга', 'value' => '203 мм'],
                    ['name' => 'Количество шлифовальных кругов', 'value' => '2'],
                    ['name' => 'Частота вращения шпинделя', 'value' => '1440 об/мин'],
                    ['name' => 'Мощность электродвигателя', 'value' => '7,5 кВт'],
                    ['name' => 'Габаритные размеры', 'value' => '1000×620×1315 мм'],
                    ['name' => 'Масса', 'value' => '560 кг']
                ]),
            ],
        ];
    }
}
