<?php

namespace Database\Seeders;

use App\Models\Service;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ServicesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Service::insert([
            [
                'name' => 'Аренда',
                'slug' => 'rental',
                'image_name' => 'rental',
                'description' => 'Компания СнабЭкспорт предлагает широкий спектр гидравлического оборудования в аренду. Все оборудование проходит проверку в нашем сервисном центре, поэтому вы можете быть уверены в его работоспособности. При желании возможен краткий инструктаж по работе с инструментом.<br/><br/>
                <ul>
                <li>Гидравлические цилиндры от 5 до 100т, высота подъема от 11 мм до 250мм</li>
                <li>Ручные гидравлические насосы в комплекте с шлангами различной длины</li>
                <li>Гайковерты гидравлические кассетного типа и с торцевой головкой</li>
                <li>Гидравлические гайкорезы</li>
                <li>Механические и гидравлические разжимы</li>
                <li>Электрические станции для подключения различного инструмента</li>
                </ul>',
            ],
            [
                'name' => 'Сервис',
                'slug' => 'service',
                'image_name' => 'service',
                'description' => 'Наша компания занимается разработкой и сопровождением технических проектов с целью ремонта и модернизации металлорежущих станков и кузнечно-прессового оборудования, а также проведением электромонтажных и пуско-наладочных работ на основании выполненных проектов. Специалисты компании предложат наилучшие решения для реализации Ваших задач, помогут приобрести комплектующие.<br/><br/>
                Предоставляем полный спектр услуг по обслуживанию и ремонту оборудования для металлообработки любой сложности. Наши опытные инженеры проведут диагностику, поиск и эффективное устранение поломок. Регулярное и качественное обслуживание гарантирует длительный срок службы вашего оборудования.<br/><br/>
                Кроме того, специалисты компании могут выполнить ремонтные работы электрической части, механики и гидравлики Вашего оборудования с полной или частичной заменой устаревших узлов, замены систем ЧПУ, установку УЦИ и т.д.<br/><br/>
                Мы специализируемся на капитальном, аварийном и текущем ремонте, а также сервисном обслуживании и модернизации металлообрабатывающего оборудования.<br/><br/>
                Наши основные услуги включают:<br/>
                <ul>
                <li>Ремонт станков и промышленного гидравлического оборудования;</li>
                <li>Модернизацию и обслуживание станков;</li>
                <li>Настройку и пусконаладку оборудования;</li>
                <li>Диагностику и калибровку станков;</li>
                <li>Поставку комплектующих и запасных частей (ЗИП);</li>
                <li>Гарантийное и послегарантийное обслуживание.</li>
                </ul><br/>
                Также наша компания предлагает услуги по капитальному ремонту универсальных токарных и токарно-винторезных, фрезерных, шлифовальных станков. Производственные возможности и опыт специалистов, соблюдение технологии и использование качественных комплектующих позволяют нам гарантировать качество и сроки выполнения работ.<br/><br/>
                Стоимость и сроки выполнения работ зависят от вида и технического состояния вашего оборудования. Более подробную информацию о выполнении работ и стоимости вы можете узнать, связавшись с нашим специалистом.<br/><br/>
                Наши клиенты:<br/>
                <ul>
                <li>АО ЕВРОХИМ-СЗ</li>
                <li>ПАО «СУРГУТНЕФТЕГАЗ»</li>
                <li>ОАО «Ачинский НПЗ ВНК» и другие предприятия.</li>
                </ul>',
            ],
            [
                'name' => 'Ремонт',
                'slug' => 'repair',
                'image_name' => 'repair',
                'description' => 'Компания «Snabexport» занимается разработкой и сопровождением технических проектов с целью ремонта и модернизации металлорежущих станков и кузнечно-прессового оборудования, а также проведением электромонтажных и пуско-наладочных работ на основании выполненных проектов. Специалисты компании предложат наилучшие решения для реализации Ваших задач, помогут приобрести комплектующие. Кроме того специалисты компании могут выполнить ремонтные работы электрической части, а также механики и гидравлики Вашего оборудования с полной или частичной заменой устаревших узлов.<br/><br/>Гарантия на выполненные работы не менее 1-го года.',
            ]
        ]);
    }
}
